Revit 2024 API
BuiltInFailures.MechanicalFailures.TwoPointsSelectedBeforeEdit Property
 Two points have to be selected before existing the edit mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TwoPointsSelectedBeforeEdit { get; }
Visual Basic
Public Shared ReadOnly Property TwoPointsSelectedBeforeEdit As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TwoPointsSelectedBeforeEdit {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MechanicalFailures Class
Autodesk.Revit.DB Namespace